# Vocabulary Bank for Age 4
# Simple to moderate words - 1-5 letters mostly
# Words that 4-year-olds can understand and use

# NOUNS (People, Animals, Objects, Places)
mom
dad
mommy
daddy
baby
boy
girl
kid
child
children
cat
dog
pig
cow
duck
hen
chicken
bee
ant
bug
spider
fish
bird
rabbit
bear
lion
tiger
elephant
butterfly
ball
toy
toys
car
bus
truck
train
plane
boat
hat
cap
cup
mug
box
bag
basket
bed
rug
carpet
chair
table
desk
door
window
gate
fence
sun
moon
star
stars
sky
cloud
clouds
tree
trees
leaf
leaves
grass
flower
flowers
rock
rocks
stone
sand
mud
dirt
water
milk
juice
soda
cake
cookie
cookies
candy
egg
eggs
bread
apple
apples
banana
bananas
orange
oranges
hand
hands
foot
feet
eye
eyes
nose
ear
ears
hair
toe
toes
leg
legs
arm
arms
head
face
body
house
home
room
rooms
yard
garden
park
playground
school
friend
friends
teacher
teachers
student
students
animal
animals
pet
pets
book
books
story
stories
picture
pictures
color
colors
game
games
song
songs
music
rain
rainbow
snow
wind

# VERBS (Actions)
go
goes
went
come
comes
came
run
runs
ran
jump
jumps
jumped
walk
walks
walked
sit
sits
sat
stand
stands
stood
fall
falls
fell
get
gets
got
put
puts
take
takes
took
give
gives
gave
eat
eats
ate
drink
drinks
drank
play
plays
played
see
sees
saw
look
looks
looked
watch
watches
watched
hear
hears
heard
listen
listens
listened
say
says
said
tell
tells
told
talk
talks
talked
speak
speaks
spoke
cry
cries
cried
laugh
laughs
laughed
smile
smiles
smiled
sleep
sleeps
slept
wake
wakes
woke
help
helps
helped
stop
stops
stopped
find
finds
found
like
likes
liked
love
loves
loved
want
wants
wanted
need
needs
needed
feel
feels
felt
make
makes
made
do
does
did
can
could
will
would
is
are
was
were
has
have
had
think
thinks
thought
know
knows
knew
learn
learns
learned
teach
teaches
taught
share
shares
shared
care
cares
cared
wait
waits
waited
try
tries
tried
work
works
worked
build
builds
built
draw
draws
drew
sing
sings
sang
dance
dances
danced
climb
climbs
climbed
swim
swims
swam
fly
flies
flew
hide
hides
hid
seek
seeks
sought
catch
catches
caught
throw
throws
threw
kick
kicks
kicked
ride
rides
rode
read
reads
write
writes
wrote
count
counts
counted
paint
paints
painted
cook
cooks
cooked
wash
washes
washed
clean
cleans
cleaned
brush
brushes
brushed
fix
fixes
fixed
break
breaks
broke
open
opens
opened
close
closes
closed
push
pushes
pushed
pull
pulls
pulled
carry
carries
carried
drop
drops
dropped
pick
picks
picked
hold
holds
held
touch
touches
touched
hug
hugs
hugged
kiss
kisses
kissed

# ADJECTIVES (Describing words)
big
bigger
biggest
small
smaller
smallest
little
tiny
huge
hot
hotter
hottest
cold
colder
coldest
warm
warmer
warmest
cool
cooler
coolest
wet
wetter
wettest
dry
drier
driest
new
newer
newest
old
older
oldest
young
younger
youngest
good
better
best
bad
worse
worst
sad
sadder
saddest
mad
madder
maddest
glad
gladder
gladdest
happy
happier
happiest
red
blue
green
yellow
pink
purple
brown
black
white
gray
grey
orange
fast
faster
fastest
slow
slower
slowest
loud
louder
loudest
quiet
quieter
quietest
soft
softer
softest
hard
harder
hardest
sweet
sweeter
sweetest
sour
nice
nicer
nicest
fun
funny
funnier
funniest
pretty
prettier
prettiest
beautiful
silly
sillier
silliest
tired
more tired
most tired
hungry
hungrier
hungriest
thirsty
thirstier
thirstiest
full
fuller
fullest
empty
clean
cleaner
cleanest
dirty
dirtier
dirtiest
open
closed
up
down
in
out
on
off
over
under
above
below
high
higher
highest
low
lower
lowest
bright
brighter
brightest
dark
darker
darkest
kind
kinder
kindest
brave
braver
bravest
smart
smarter
smartest
strong
stronger
strongest
gentle
gentler
gentlest
friendly
friendlier
friendliest
excited
more excited
most excited
proud
prouder
proudest
scared
more scared
most scared
afraid
safe
safer
safest
unsafe
careful
more careful
most careful
patient
more patient
most patient
important
special
wonderful
amazing
colorful

# ADVERBS (How words)
now
here
there
where
yes
no
maybe
more
most
less
least
again
too
so
very
well
better
best
then
soon
sooner
soonest
later
today
tomorrow
yesterday
always
sometimes
never
first
last
next
together
alone
carefully
quickly
slowly
happily
sadly
quietly
loudly
gently
bravely
kindly

# PHRASES
once upon a time
the end
good night
good morning
good afternoon
good evening
thank you
thanks
please
sorry
hello
hi
goodbye
bye
see you later
excuse me
you are welcome
you're welcome
how are you
i'm fine
nice to meet you
