# Vocabulary Bank for Age 7
# Advanced words - 1-8 letters mostly
# Words that 7-year-olds can understand and use

# NOUNS
mom
dad
parent
parents
baby
boy
girl
kid
child
children
person
people
family
cat
dog
puppy
kitten
animal
animals
pet
pets
bird
fish
rabbit
bear
lion
tiger
elephant
butterfly
ball
toy
toys
car
bus
truck
train
plane
boat
ship
hat
cup
box
bag
bed
chair
table
door
window
house
home
room
rooms
yard
garden
park
school
friend
friends
teacher
teachers
student
students
book
books
story
stories
picture
pictures
color
colors
game
games
song
songs
music
sun
moon
star
stars
sky
cloud
clouds
tree
trees
flower
flowers
rock
rocks
water
milk
juice
cake
cookie
cookies
candy
apple
apples
banana
bananas
orange
oranges
hand
hands
foot
feet
eye
eyes
nose
ear
ears
hair
leg
legs
arm
arms
head
heads
face
faces
body
bodies
rain
rainbow
rainbows
snow
wind
ocean
oceans
beach
beaches
mountain
mountains
forest
forests
river
rivers
lake
lakes
neighbor
neighbors
community
communities
village
villages
town
towns
city
cities
country
countries
world
worlds
planet
planets
adventure
adventures
journey
journeys
trip
trips
discovery
discoveries
treasure
treasures
magic
wish
wishes
dream
dreams
hope
hopes
courage
kindness
honesty
patience
respect
team
teams
teamwork
problem
problems
solution
solutions
idea
ideas
plan
plans
choice
choices
decision
decisions
mistake
mistakes
lesson
lessons
answer
answers
question
questions
castle
castles
princess
princesses
prince
princes
knight
knights
dragon
dragons
wizard
wizards
king
kings
queen
queens
hero
heroes
heroine
heroines
villain
villains
monster
monsters
giant
giants
fairy
fairies
elf
elves
dwarf
dwarves
unicorn
unicorns
mermaid
mermaids
pirate
pirates
sailor
sailors
explorer
explorers
detective
detectives
scientist
scientists
doctor
doctors
nurse
nurses
firefighter
firefighters
police
officer
officers
artist
artists
musician
musicians
singer
singers
dancer
dancers
actor
actors
athlete
athletes
player
players
coach
coaches
captain
captains
leader
leaders
helper
helpers
volunteer
volunteers
citizen
citizens
guest
guests
visitor
visitors
traveler
travelers
passenger
passengers
driver
drivers
pilot
pilots
crew
member
members
group
groups
club
clubs
class
classes
grade
grades
library
libraries
museum
museums
zoo
zoos
aquarium
aquariums
theater
theaters
stadium
stadiums
playground
playgrounds
pool
pools
island
islands
hill
hills
valley
valleys
jungle
jungles
desert
deserts
field
fields
meadow
meadows
farm
farms
barn
barns
garage
garages
workshop
workshops
studio
studios
office
offices
store
stores
shop
shops
market
markets
mall
malls
restaurant
restaurants
cafe
cafes
hotel
hotels
hospital
hospitals
clinic
clinics
bank
banks
post office
post offices
police station
police stations
fire station
fire stations
church
churches
temple
temples
airport
airports
train station
train stations
bus station
bus stations
subway
subways
taxi
taxis
van
vans
motorcycle
motorcycles
bicycle
bicycles
scooter
scooters
skateboard
skateboards
sled
sleds
sleigh
sleighs
backpack
backpacks
purse
purses
wallet
wallets
suitcase
suitcases
luggage
lunch box
lunch boxes
water bottle
water bottles
trophy
trophies
medal
medals
ribbon
ribbons
badge
badges
ticket
tickets
card
cards
gift card
gift cards
library card
library cards
student id
student ids
passport
passports
certificate
certificates
diploma
diplomas
award
awards
prize
prizes
reward
rewards
payment
payments
fee
fees
cost
costs
price
prices
value
values
money
coin
coins
dollar
dollars
cent
cents
penny
pennies
nickel
nickels
dime
dimes
quarter
quarters
check
checks
currency

# VERBS
go
goes
went
going
come
comes
came
coming
run
runs
ran
running
jump
jumps
jumped
jumping
walk
walks
walked
walking
sit
sits
sat
sitting
stand
stands
stood
standing
fall
falls
fell
falling
get
gets
got
getting
put
puts
putting
take
takes
took
taking
give
gives
gave
giving
eat
eats
ate
eating
drink
drinks
drank
drinking
play
plays
played
playing
see
sees
saw
seeing
look
looks
looked
looking
watch
watches
watched
watching
hear
hears
heard
hearing
listen
listens
listened
listening
say
says
said
saying
tell
tells
told
telling
talk
talks
talked
talking
speak
speaks
spoke
speaking
cry
cries
cried
crying
laugh
laughs
laughed
laughing
smile
smiles
smiled
smiling
sleep
sleeps
slept
sleeping
wake
wakes
woke
waking
help
helps
helped
helping
stop
stops
stopped
stopping
find
finds
found
finding
like
likes
liked
liking
love
loves
loved
loving
want
wants
wanted
wanting
need
needs
needed
needing
feel
feels
felt
feeling
make
makes
made
making
do
does
did
doing
think
thinks
thought
thinking
know
knows
knew
knowing
learn
learns
learned
learning
teach
teaches
taught
teaching
share
shares
shared
sharing
care
cares
cared
caring
wait
waits
waited
waiting
try
tries
tried
trying
work
works
worked
working
build
builds
built
building
draw
draws
drew
drawing
sing
sings
sang
singing
dance
dances
danced
dancing
climb
climbs
climbed
climbing
swim
swims
swam
swimming
fly
flies
flew
flying
hide
hides
hid
hiding
catch
catches
caught
catching
throw
throws
threw
throwing
kick
kicks
kicked
kicking
ride
rides
rode
riding
read
reads
read
reading
write
writes
wrote
writing
count
counts
counted
counting
paint
paints
painted
painting
cook
cooks
cooked
cooking
wash
washes
washed
washing
clean
cleans
cleaned
cleaning
brush
brushes
brushed
brushing
fix
fixes
fixed
fixing
break
breaks
broke
breaking
open
opens
opened
opening
close
closes
closed
closing
push
pushes
pushed
pushing
pull
pulls
pulled
pulling
carry
carries
carried
carrying
drop
drops
dropped
dropping
pick
picks
picked
picking
hold
holds
held
holding
touch
touches
touched
touching
hug
hugs
hugged
hugging
kiss
kisses
kissed
kissing
explore
explores
explored
exploring
discover
discovers
discovered
discovering
imagine
imagines
imagined
imagining
create
creates
created
creating
invent
invents
invented
inventing
solve
solves
solved
solving
decide
decides
decided
deciding
choose
chooses
chose
choosing
understand
understands
understood
understanding
remember
remembers
remembered
remembering
forget
forgets
forgot
forgetting
believe
believes
believed
believing
trust
trusts
trusted
trusting
promise
promises
promised
promising
forgive
forgives
forgave
forgiving
apologize
apologizes
apologized
apologizing
appreciate
appreciates
appreciated
appreciating
respect
respects
respected
respecting
admire
admires
admired
admiring
encourage
encourages
encouraged
encouraging
support
supports
supported
supporting
protect
protects
protected
protecting
defend
defends
defended
defending
challenge
challenges
challenged
challenging
overcome
overcomes
overcame
overcoming
succeed
succeeds
succeeded
succeeding
achieve
achieves
achieved
achieving
accomplish
accomplishes
accomplished
accomplishing

# ADJECTIVES
big
bigger
biggest
small
smaller
smallest
little
tiny
huge
enormous
hot
hotter
hottest
cold
colder
coldest
warm
warmer
warmest
cool
cooler
coolest
wet
wetter
wettest
dry
drier
driest
new
newer
newest
old
older
oldest
young
younger
youngest
good
better
best
bad
worse
worst
sad
sadder
saddest
mad
madder
maddest
glad
gladder
gladdest
happy
happier
happiest
joyful
red
blue
green
yellow
pink
purple
brown
black
white
gray
grey
orange
fast
faster
fastest
slow
slower
slowest
loud
louder
loudest
quiet
quieter
quietest
soft
softer
softest
hard
harder
hardest
sweet
sweeter
sweetest
sour
bitter
nice
nicer
nicest
fun
funny
funnier
funniest
pretty
prettier
prettiest
beautiful
silly
sillier
silliest
tired
hungry
hungrier
hungriest
thirsty
thirstier
thirstiest
full
fuller
fullest
empty
clean
cleaner
cleanest
dirty
dirtier
dirtiest
open
closed
up
down
in
out
on
off
over
under
above
below
high
higher
highest
low
lower
lowest
bright
brighter
brightest
dark
darker
darkest
kind
kinder
kindest
brave
braver
bravest
smart
smarter
smartest
strong
stronger
strongest
gentle
gentler
gentlest
friendly
friendlier
friendliest
excited
proud
prouder
proudest
scared
afraid
safe
safer
safest
careful
patient
important
special
wonderful
amazing
colorful
helpful
thoughtful
generous
honest
truthful
responsible
reliable
trustworthy
confident
determined
persistent
curious
creative
imaginative
wise
wiser
wisest
clever
cleverer
cleverest
brilliant
talented
skilled
mature
independent
cooperative
compassionate
grateful
humble
modest
courageous
fearless
adventurous

# ADVERBS
now
here
there
where
everywhere
anywhere
somewhere
yes
no
maybe
perhaps
probably
definitely
more
most
less
least
again
too
so
very
really
quite
well
better
best
then
soon
sooner
soonest
later
earlier
earliest
today
tomorrow
yesterday
always
sometimes
often
usually
rarely
seldom
never
first
last
next
before
after
together
alone
carefully
quickly
slowly
happily
sadly
quietly
loudly
gently
bravely
kindly
honestly
patiently
respectfully
gratefully
confidently
creatively
wisely

# PHRASES
once upon a time
the end
good night
good morning
good afternoon
good evening
thank you
thanks
please
sorry
i'm sorry
hello
hi
goodbye
bye
see you later
see you soon
excuse me
pardon me
you are welcome
you're welcome
how are you
i'm fine
i'm good
nice to meet you
pleased to meet you
have a nice day
have a good day
good luck
congratulations
well done
great job
good job
i love you
i like you
i miss you
see you tomorrow
what's your name
my name is
how old are you
i am seven years old
where are you from
i am from
what do you like
i like
what is your favorite
my favorite is
can you help me
i need help
can i help you
let's play together
let's be friends
we are friends
friends help each other
sharing is caring
teamwork makes the dream work
practice makes perfect
try your best
never give up
believe in yourself
be kind to others
respect others
listen carefully
think before you act
make good choices
learn from mistakes
always tell the truth
honesty is the best policy
patience is a virtue
be grateful for what you have
help those in need
stand up for what is right
be brave
be strong
be yourself
dream big
work hard
play fair
have fun
be happy
stay safe
take care
be careful
