# Vocabulary Bank for Age 8
# Most advanced words - 1-9 letters mostly
# Words that 8-year-olds can understand and use

# NOUNS
mom
dad
parent
parents
baby
babies
boy
boys
girl
girls
kid
kids
child
children
person
people
family
families
cat
cats
kitten
kittens
dog
dogs
puppy
puppies
animal
animals
pet
pets
bird
birds
fish
fishes
rabbit
rabbits
bear
bears
lion
lions
tiger
tigers
elephant
elephants
butterfly
butterflies
ball
balls
toy
toys
car
cars
bus
buses
truck
trucks
train
trains
plane
planes
airplane
airplanes
boat
boats
ship
ships
hat
hats
cap
caps
cup
cups
mug
mugs
box
boxes
bag
bags
bed
beds
chair
chairs
table
tables
desk
desks
door
doors
window
windows
house
houses
home
homes
room
rooms
bedroom
bedrooms
kitchen
kitchens
bathroom
bathrooms
yard
yards
garden
gardens
park
parks
playground
playgrounds
school
schools
classroom
classrooms
friend
friends
friendship
friendships
teacher
teachers
student
students
classmate
classmates
book
books
story
stories
tale
tales
picture
pictures
photo
photos
color
colors
game
games
sport
sports
song
songs
music
dance
dances
sun
moon
star
stars
sky
skies
cloud
clouds
tree
trees
leaf
leaves
flower
flowers
rock
rocks
stone
stones
water
milk
juice
soda
pop
cake
cakes
cookie
cookies
candy
candies
egg
eggs
bread
loaf
loaves
apple
apples
banana
bananas
orange
oranges
grape
grapes
hand
hands
finger
fingers
foot
feet
toe
toes
eye
eyes
nose
ear
ears
hair
leg
legs
arm
arms
head
heads
face
faces
body
bodies
rain
rainbow
rainbows
snow
wind
storm
storms
ocean
oceans
beach
beaches
mountain
mountains
forest
forests
river
rivers
lake
lakes
neighbor
neighbors
community
communities
village
villages
town
towns
city
cities
country
countries
world
worlds
planet
planets
universe
galaxy
galaxies
adventure
adventures
journey
journeys
trip
trips
discovery
discoveries
treasure
treasures
magic
wish
wishes
dream
dreams
hope
hopes
courage
kindness
honesty
patience
respect
responsibility
team
teams
teamwork
problem
problems
solution
solutions
idea
ideas
plan
plans
choice
choices
decision
decisions
mistake
mistakes
lesson
lessons
answer
answers
question
questions
castle
castles
princess
princesses
prince
princes
knight
knights
dragon
dragons
wizard
wizards
king
kings
queen
queens
hero
heroes
heroine
heroines
villain
villains
monster
monsters
giant
giants
fairy
fairies
elf
elves
dwarf
dwarves
unicorn
unicorns
mermaid
mermaids
pirate
pirates
sailor
sailors
explorer
explorers
detective
detectives
scientist
scientists
doctor
doctors
nurse
nurses
firefighter
firefighters
police
officer
officers
artist
artists
musician
musicians
singer
singers
dancer
dancers
actor
actors
athlete
athletes
player
players
coach
coaches
captain
captains
leader
leaders
helper
helpers
volunteer
volunteers
citizen
citizens
guest
guests
visitor
visitors
traveler
travelers
passenger
passengers
driver
drivers
pilot
pilots
crew
member
members
group
groups
club
clubs
class
classes
grade
grades
library
libraries
museum
museums
zoo
zoos
aquarium
aquariums
theater
theaters
stadium
stadiums
playground
playgrounds
pool
pools
island
islands
hill
hills
valley
valleys
jungle
jungles
desert
deserts
field
fields
meadow
meadows
farm
farms
barn
barns
garage
garages
workshop
workshops
studio
studios
office
offices
store
stores
shop
shops
market
markets
mall
malls
restaurant
restaurants
cafe
cafes
hotel
hotels
hospital
hospitals
clinic
clinics
bank
banks
post office
post offices
police station
police stations
fire station
fire stations
church
churches
temple
temples
airport
airports
train station
train stations
bus station
bus stations
subway
subways
taxi
taxis
van
vans
motorcycle
motorcycles
bicycle
bicycles
scooter
scooters
skateboard
skateboards
sled
sleds
sleigh
sleighs
backpack
backpacks
purse
purses
wallet
wallets
suitcase
suitcases
luggage
lunch box
lunch boxes
water bottle
water bottles
trophy
trophies
medal
medals
ribbon
ribbons
badge
badges
ticket
tickets
card
cards
gift card
gift cards
library card
library cards
student id
student ids
passport
passports
certificate
certificates
diploma
diplomas
award
awards
prize
prizes
reward
rewards
payment
payments
fee
fees
cost
costs
price
prices
value
values
money
coin
coins
dollar
dollars
cent
cents
penny
pennies
nickel
nickels
dime
dimes
quarter
quarters
check
checks
currency

# VERBS
go
goes
went
going
gone
come
comes
came
coming
run
runs
ran
running
jump
jumps
jumped
jumping
walk
walks
walked
walking
sit
sits
sat
sitting
stand
stands
stood
standing
fall
falls
fell
falling
get
gets
got
getting
gotten
put
puts
putting
take
takes
took
taking
taken
give
gives
gave
giving
given
eat
eats
ate
eating
eaten
drink
drinks
drank
drinking
drunk
play
plays
played
playing
see
sees
saw
seeing
seen
look
looks
looked
looking
watch
watches
watched
watching
hear
hears
heard
hearing
listen
listens
listened
listening
say
says
said
saying
tell
tells
told
telling
talk
talks
talked
talking
speak
speaks
spoke
speaking
spoken
cry
cries
cried
crying
laugh
laughs
laughed
laughing
smile
smiles
smiled
smiling
sleep
sleeps
slept
sleeping
wake
wakes
woke
waking
woken
help
helps
helped
helping
stop
stops
stopped
stopping
find
finds
found
finding
like
likes
liked
liking
love
loves
loved
loving
want
wants
wanted
wanting
need
needs
needed
needing
feel
feels
felt
feeling
make
makes
made
making
do
does
did
doing
done
think
thinks
thought
thinking
know
knows
knew
knowing
known
learn
learns
learned
learning
teach
teaches
taught
teaching
share
shares
shared
sharing
care
cares
cared
caring
wait
waits
waited
waiting
try
tries
tried
trying
work
works
worked
working
build
builds
built
building
draw
draws
drew
drawing
drawn
sing
sings
sang
singing
sung
dance
dances
danced
dancing
climb
climbs
climbed
climbing
swim
swims
swam
swimming
swum
fly
flies
flew
flying
flown
hide
hides
hid
hiding
hidden
catch
catches
caught
catching
throw
throws
threw
throwing
thrown
kick
kicks
kicked
kicking
ride
rides
rode
riding
ridden
read
reads
read
reading
write
writes
wrote
writing
written
count
counts
counted
counting
paint
paints
painted
painting
cook
cooks
cooked
cooking
wash
washes
washed
washing
clean
cleans
cleaned
cleaning
brush
brushes
brushed
brushing
fix
fixes
fixed
fixing
break
breaks
broke
breaking
broken
open
opens
opened
opening
close
closes
closed
closing
push
pushes
pushed
pushing
pull
pulls
pulled
pulling
carry
carries
carried
carrying
drop
drops
dropped
dropping
pick
picks
picked
picking
hold
holds
held
holding
touch
touches
touched
touching
hug
hugs
hugged
hugging
kiss
kisses
kissed
kissing
explore
explores
explored
exploring
discover
discovers
discovered
discovering
imagine
imagines
imagined
imagining
create
creates
created
creating
invent
invents
invented
inventing
solve
solves
solved
solving
decide
decides
decided
deciding
choose
chooses
chose
choosing
chosen
understand
understands
understood
understanding
remember
remembers
remembered
remembering
forget
forgets
forgot
forgetting
forgotten
believe
believes
believed
believing
trust
trusts
trusted
trusting
promise
promises
promised
promising
forgive
forgives
forgave
forgiving
forgiven
apologize
apologizes
apologized
apologizing
appreciate
appreciates
appreciated
appreciating
respect
respects
respected
respecting
admire
admires
admired
admiring
encourage
encourages
encouraged
encouraging
support
supports
supported
supporting
protect
protects
protected
protecting
defend
defends
defended
defending
challenge
challenges
challenged
challenging
overcome
overcomes
overcame
overcoming
succeed
succeeds
succeeded
succeeding
achieve
achieves
achieved
achieving
accomplish
accomplishes
accomplished
accomplishing

# ADJECTIVES
big
bigger
biggest
small
smaller
smallest
little
tiny
huge
enormous
gigantic
massive
hot
hotter
hottest
cold
colder
coldest
warm
warmer
warmest
cool
cooler
coolest
wet
wetter
wettest
dry
drier
driest
new
newer
newest
old
older
oldest
young
younger
youngest
good
better
best
bad
worse
worst
sad
sadder
saddest
mad
madder
maddest
glad
gladder
gladdest
happy
happier
happiest
joyful
cheerful
merry
red
blue
green
yellow
pink
purple
brown
black
white
gray
grey
orange
fast
faster
fastest
slow
slower
slowest
loud
louder
loudest
quiet
quieter
quietest
soft
softer
softest
hard
harder
hardest
sweet
sweeter
sweetest
sour
bitter
salty
spicy
nice
nicer
nicest
fun
funny
funnier
funniest
pretty
prettier
prettiest
beautiful
gorgeous
stunning
silly
sillier
silliest
tired
exhausted
hungry
hungrier
hungriest
thirsty
thirstier
thirstiest
full
fuller
fullest
empty
clean
cleaner
cleanest
dirty
dirtier
dirtiest
open
closed
up
down
in
out
on
off
over
under
above
below
high
higher
highest
low
lower
lowest
bright
brighter
brightest
dark
darker
darkest
kind
kinder
kindest
brave
braver
bravest
smart
smarter
smartest
intelligent
brilliant
strong
stronger
strongest
gentle
gentler
gentlest
friendly
friendlier
friendliest
excited
thrilled
proud
prouder
proudest
scared
afraid
frightened
terrified
safe
safer
safest
careful
patient
important
significant
special
unique
wonderful
amazing
incredible
colorful
vibrant
helpful
thoughtful
considerate
generous
honest
truthful
sincere
responsible
reliable
trustworthy
confident
determined
persistent
resilient
curious
creative
imaginative
innovative
wise
wiser
wisest
clever
cleverer
cleverest
brilliant
talented
skilled
experienced
mature
independent
cooperative
compassionate
empathetic
grateful
humble
modest
courageous
fearless
adventurous
explorative

# ADVERBS
now
here
there
where
everywhere
anywhere
somewhere
yes
no
maybe
perhaps
probably
definitely
certainly
absolutely
more
most
less
least
again
too
so
very
really
quite
extremely
well
better
best
then
soon
sooner
soonest
later
earlier
earliest
today
tomorrow
yesterday
always
sometimes
often
usually
rarely
seldom
never
first
last
next
before
after
together
alone
carefully
quickly
slowly
happily
sadly
quietly
loudly
gently
bravely
kindly
honestly
patiently
respectfully
responsibly
gratefully
humbly
confidently
determinedly
curiously
creatively
wisely
cleverly
thoughtfully
considerately
generously
helpfully

# PHRASES
once upon a time
the end
good night
good morning
good afternoon
good evening
thank you
thanks
thank you very much
please
please and thank you
sorry
i'm sorry
i apologize
hello
hi
hey
goodbye
bye
see you later
see you soon
see you tomorrow
excuse me
pardon me
you are welcome
you're welcome
how are you
i'm fine
i'm good
i'm great
nice to meet you
pleased to meet you
have a nice day
have a good day
have a great day
good luck
congratulations
well done
great job
good job
excellent work
outstanding
fantastic
awesome
terrific
i love you
i like you
i miss you
what's your name
my name is
how old are you
i am eight years old
where are you from
i am from
what do you like
i like
what is your favorite
my favorite is
can you help me
i need help
can i help you
let's play together
let's be friends
we are friends
friends help each other
sharing is caring
teamwork makes the dream work
practice makes perfect
try your best
never give up
believe in yourself
be kind to others
respect others
listen carefully
think before you act
make good choices
learn from mistakes
always tell the truth
honesty is the best policy
patience is a virtue
be grateful for what you have
help those in need
stand up for what is right
be brave
be strong
be yourself
dream big
work hard
play fair
have fun
be happy
stay safe
take care
be careful
watch out
look both ways
